Revit 2026 API

# DWGExportOptionsGetPredefinedOptions Method

---

Returns an instance DWGExportOptions containing settings from a predefined export setup.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DWGExportOptions GetPredefinedOptions(
	Document document,
	string setup
)
```
```vb
Public Shared Function GetPredefinedOptions (
	document As Document,
	setup As String
) As DWGExportOptions
```
```cpp
public:
static DWGExportOptions^ GetPredefinedOptions(
	Document^ document,
	String^ setup
)
```
```fsharp
static member GetPredefinedOptions :
        document : Document *
        setup : string -> DWGExportOptions
```

#### Parameters

document Document
     A Revit project document to retrieve the setup from.
setup String
     The name of a predefined export setup from the specified document.

#### Return Value

DWGExportOptions An instance of predefined DWGExportOptions, or  if the name was not found.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DWGExportOptions Class

Autodesk.Revit.DB Namespace